/* THE ONLY TASK OF THIS PROGRAM IS TO SHOWCASE THE STRUCTURES AND  */
/* PROVIDE WITH AN EXAMPLE HOW TO MOVE 'STRING' INTO STRUCTURE     */

MAIN: PROC OPTIONS(MAIN);
	DECLARE INFILE_EOF BIT(1) INIT('0'B);
	DECLARE DATA_AREA CHAR(40);
	ON ENDFILE(INFILE)
		INFILE_EOF = '1'B;
	ON RECORD(INFILE)
		BEGIN;
		PUT SKIP LIST("RECORD CONDITION HOW HOW HOW");	
		PUT SKIP LIST("RECORD CONDITION HOW HOW HOW");	
		END;
	PUT SKIP LIST('MY HELLO WORLD');
	DECLARE INFILE FILE STREAM INPUT ;
		
	OPEN FILE(INFILE) TITLE('INFILE.TXT');
	
	PUT SKIP LIST('AFTER OPEN');
        GET FILE(INFILE) EDIT(DATA_AREA) (A(40));
  	DO UNTIL(INFILE_EOF);
  		
		PUT SKIP LIST(PREPARE(DATA_AREA));		
		DATA_AREA = '' ;
	        GET FILE(INFILE) EDIT(DATA_AREA) (A(40));
	END; 
	CLOSE FILE(INFILE);
	PUT SKIP LIST('END OF THE PROGRAM');
	PREPARE: PROC(INSTRING) RETURNS(CHAR(100);
		DECLARE INSTRING CHAR(40);	
		DECLARE 1 STRUCT,
			2 FIRST_NAME CHAR(10),
			2 LAST_NAME  CHAR(10),
			2 NICK       CHAR(10), 
			2 ID         CHAR(10);
		STRING(STRUCT)  = INSTRING;	
		
		RETURN('FIRST NAME ' || FIRST_NAME  ||
			' LAST NAME ' || LAST_NAME   ||
			' NICK '      || NICK        ||
			' ID '        || ID );                           				
	END PREPARE;
END MAIN;