   /*    MFIRST PROGRAM                                         */
   /*    TASK:  READ INPUT FILE AND SORT OUTPUT                 */
   /*           IF FIRST LETTER IN THE RECORD IS 'F' THEN FILE 'F' */
   /*           IF FIRST LETTER IN THE RECORD IS 'V' THEN FILE 'V' */

MAIN: PROC OPTIONS(MAIN);
   DECLARE FILEF FILE RECORD OUTPUT ;
   DECLARE FILEV FILE RECORD OUTPUT ;
   DECLARE FINPUT FILE RECORD INPUT ;
   DECLARE INEND BIT(1) INIT('0'B);
   DECLARE INPUT_REC CHAR(35);
   DECLARE INV_COUNTER FIXED BIN(15);
   DECLARE SUBSTR BUILTIN;
   ON ENDFILE(FINPUT)
      INEND = '1'B;
   INV_COUNTER = 0;
   OPEN FILE(FINPUT);
   OPEN FILE(FILEF);
   OPEN FILE(FILEV);

   READ FILE(FINPUT) INTO(INPUT_REC);
   DO UNTIL(INEND);
      /* PUT SKIP LIST('FILE IN: ' || INPUT_REC); */
      READ FILE(FINPUT) INTO(INPUT_REC);
      SELECT;
         WHEN (SUBSTR(INPUT_REC,1,1) = 'F')
            WRITE FILE(FILEF) FROM(INPUT_REC);
         WHEN (SUBSTR(INPUT_REC,1,1) = 'V')
            WRITE FILE(FILEV) FROM(INPUT_REC);
         OTHERWISE
            DO;
               PUT SKIP LIST('INVALID RECORD!');
               INV_COUNTER = INV_COUNTER +1;
            END;
      END;
   END;

   PUT SKIP LIST('END OF THE INPUT FILE');
   PUT SKIP LIST('INV REC COUNTER: ' || INV_COUNTER);
   CLOSE FILE(FINPUT);
   CLOSE FILE(FILEF);
   CLOSE FILE(FILEV);

END MAIN;